app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "contene", "created_at", "updated_at") VALUES ('post 1', 'text of post', '2025-07-09 08:55:31.542530', '2025-07-09 08:55:31.542530') RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (1, 'dsfdsfs 2', '2025-07-09 10:47:46.374282', '2025-07-09 10:47:46.374282') RETURNING "id"
---
  def comment
    @post = Post.find(params[:id])
    @post.comments.create!(comment_params)